Revit 2027 API
UpdaterInfo.ApplicationName Property
 Name of the application that owns the updater.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ApplicationName { get; }
Public ReadOnly Property ApplicationName As String
	Get
public:
property String^ ApplicationName {
	String^ get ();
}
member ApplicationName : string with get
Property Value
String
See Also
Reference
UpdaterInfo Class
Autodesk.Revit.DB Namespace